ХМНПФ_Общее/Documents/уп_НачислениеПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачислениеПенсий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьНБТекущимПериодом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Доначисление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокПенсионеров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НачалоПериодаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Доплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ЭтоВосстановлениеЗадолженности</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПенсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КонецПериодаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Периодичность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Пенсия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачислениеЗадолженностиПоПриостановкам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НачалоПериодаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КонецПериодаНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Пенсия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Доплата</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_НачислениеПенсий/Ext/ManagerModule.bsl
Процедура НПФ_РассчитатьСервер(Объект) Экспорт
	
	ТЗДокумента = Новый ТаблицаЗначений();
	ТЗДокумента.Колонки.Добавить("НомерСчета");
	ТЗДокумента.Колонки.Добавить("Вкладчик");
	ТЗДокумента.Колонки.Добавить("Схема");
	ТЗДокумента.Колонки.Добавить("ТипПенсии");   
	ТЗДокумента.Колонки.Добавить("ТипВкладчика");   
	ТЗДокумента.Колонки.Добавить("НачалоПериода", Новый ОписаниеТипов("Дата"));
	ТЗДокумента.Колонки.Добавить("КонецПериода", Новый ОписаниеТипов("Дата"));
	ТЗДокумента.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТЗДокумента.Колонки.Добавить("Пенсия", Новый ОписаниеТипов("Число")); //Бардошина +-
	ТЗДокумента.Колонки.Добавить("Доплата", Новый ОписаниеТипов("Число")); //Бардошина +-
	ТЗДокумента.Колонки.Добавить("ПоследняяВыплата", Новый ОписаниеТипов("Булево"));
	ТЗДокумента.Колонки.Добавить("Пусто");
	ТЗДокумента.Колонки.Добавить("Получатель");
	ТЗДокумента.Колонки.Добавить("ГруппаДоговора");
	ТЗДокумента.Колонки.Добавить("ПенсионныйДоговор");         
	ТЗДокумента.Колонки.Добавить("ОчередностьВыплаты");
	ТЗДокумента.Колонки.Добавить("Периодичность");
	ТЗДокумента.Колонки.Добавить("ПодразделениеБУ");
	ТЗДокумента.Колонки.Добавить("ЭтоЗадолженность"); //Бардошина +-
	ТЗДокумента.Колонки.Добавить("ЭтоВосстановлениеЗадолженности"); //Бардошина +-

	РассчитыватьТЧ = Истина;

	//проверить, что период везде заполнен
	Для каждого стр из Объект.СписокПенсионеров Цикл
		Если НЕ значениеЗаполнено(стр.НачалоПериодаНачисления) или
			НЕ ЗначениеЗаполнено(стр.КонецПериодаНачисления) Тогда
			Сообщить("В строке "+стр.НомерСтроки+" не указан период начисления. Расчет произведен быть не может.");
			РассчитыватьТЧ = Ложь;
		КонецЕсли;	
	КонецЦикла;	 

	ИмяРасчетаПенсий = уп_НПОСервер.ПолучитьИмяМодуляРасчетаПенсий();   
	Если СтрНайти(ИмяРасчетаПенсий, "Ошибка") <> 0 Тогда 
		Сообщить("Расчет невозможен. "+ИмяРасчетаПенсий);  
		Возврат;
	Иначе
		МодульРасчетаПенсий = ОбщегоНазначения.ОбщийМодуль(ИмяРасчетаПенсий);   //по умолчанию  уп_ОбщегоНазначенияУчетРезервов
	КонецЕсли;	

	Если РассчитыватьТЧ Тогда
		// Выбрать в отдельные списки с разной периодичностью
		// и с разными датами начала периода

		//соберем даты начала периода
		РезультатПоПериодам = СформироватьТаблицуПериодов(Объект);

		ТаблицаДоплат = Новый ТаблицаЗначений;
		ТаблицаДоплат.Колонки.Добавить("НомерСчета", Новый ОписаниеТипов("СправочникСсылка.уп_ПенсионныеСчета"));
		ТаблицаДоплат.Колонки.Добавить("КоличествоНачисленныхДоплат", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(5));

		ВыборкаПериодичность = РезультатПоПериодам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаПериодичность.Следующий() Цикл
			ВыборкаПериодов = ВыборкаПериодичность.Выбрать();
			Пока ВыборкаПериодов.Следующий() Цикл
				ТаблицаСчетов = СформироватьТаблицуСчетов(Объект,ВыборкаПериодичность.Периодичность,ВыборкаПериодов.НачалоПериодаНачисления);
				ТаблицаСчетов.Колонки.Добавить("НомерНачисления", ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповЧисла(5));

				ТаблицаСчетов.ЗаполнитьЗначения(1,"НомерНачисления");
				//		
				Если ТаблицаСчетов.Количество()>0 Тогда
					//добавлено
					Если ТЗДокумента.Количество()>0 Тогда
						Для Каждого строкаТС из ТаблицаСчетов Цикл
							СтрокиТЗДокумента = ТЗДокумента.НайтиСтроки(Новый Структура("НомерСчета", строкаТС.НомерСчета));
							Если СтрокиТЗДокумента.Количество()>0 Тогда
								СтрокаТС.НомерНачисления = строкаТС.НомерНачисления+СтрокиТЗДокумента.Количество();
								Для а=0 по СтрокиТЗДокумента.Количество()-1 Цикл
									СтрокаТС.НачисленоРаннее = СтрокаТС.НачисленоРаннее+СтрокиТЗДокумента.Получить(а).Сумма;
								КонецЦикла;	
							КонецЕсли;	
						КонецЦикла;	
					КонецЕсли;
					//
					//Бардошина +

					ТЗОстаткиПоЗадолженности = МодульРасчетаПенсий.ПолучитьТаблицуОстатковПоЗадолженности(ТаблицаСчетов, Объект.Дата, ВыборкаПериодов.НачалоПериодаНачисления);
					МодульРасчетаПенсий.СформироватьТЗНачисления(Объект.Организация,ТЗДокумента, ВыборкаПериодичность.Периодичность, ТаблицаСчетов
					, Объект.Дата, ВыборкаПериодов.НачалоПериодаНачисления, ТЗОстаткиПоЗадолженности, ТаблицаДоплат);
					//Бардошина -
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
		//
		Для каждого стр из Объект.СписокПенсионеров Цикл
//#Вставка
			Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") Тогда
				Продолжить;
			КонецЕсли;
//#КонецВставки
			//Если Стр.
			//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю();
			МассивСтрТЗ = ТЗДокумента.НайтиСтроки(Новый Структура("НомерСчета,КонецПериода,ЭтоЗадолженность",стр.НомерСчета,КонецДня(стр.КонецПериодаНачисления),Ложь));
			Если МассивСтрТЗ.Количество()<>0 Тогда
				СтрТЗ = МассивСтрТЗ.Получить(0);
				//Бардошина +
				стр.Сумма = СтрТЗ.Сумма;
				стр.Пенсия = СтрТЗ.Пенсия;	
				стр.Доплата = СтрТЗ.Доплата; 
				//Бардошина -
			Иначе
				// Молчанов Ортикон НАЧАЛО 28.12.2017
				//Сообщить("Для счета № "+СокрЛП(стр.НомерСчета.Код)+" расчет либо не сделан, либо сумма = 0.");
				Сообщить("Для счета № "+СокрЛП(стр.НомерСчета)+" расчет либо не сделан, либо сумма = 0.");
				// Молчанов Ортикон КОНЕЦ 28.12.2017
			КонецЕсли;	
		КонецЦикла;

		//Бардошина +
		//расчет по ТЧ npo_НачислениеЗадолженностиПоПриостановкам
		Для каждого стр из Объект.НачислениеЗадолженностиПоПриостановкам Цикл
			МассивСтрТЗ = ТЗДокумента.НайтиСтроки(Новый Структура("НомерСчета,НачалоПериода, ЭтоЗадолженность",стр.НомерСчета,стр.НачалоПериодаНачисления,Истина));
//#Вставка
	// +ХМНПФ 08.10.2024 ЛыткинАМ // Начисление пенсии после воостановления // №3453
			Если ЗначениеЗаполнено(Объект.ДокументОснование) И ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") Тогда
				МассивСтрТЗ = ТЗДокумента.НайтиСтроки(Новый Структура("НомерСчета,НачалоПериода",стр.НомерСчета,стр.НачалоПериодаНачисления)); //стр.НачалоПериодаНачисления = Объект.ПериодНачисления
			КонецЕсли;
	// +ХМНПФ 08.10.2024 ЛыткинАМ // Начисление пенсии после воостановления // №3453
//#КонецВставки
			Если МассивСтрТЗ.Количество()<>0 Тогда
				СтрТЗ = МассивСтрТЗ.Получить(0);
				стр.Сумма = СтрТЗ.Сумма;
				стр.Пенсия = СтрТЗ.Пенсия;	
				стр.Доплата = СтрТЗ.Доплата; 
			Иначе
				// Молчанов Ортикон НАЧАЛО 28.12.2017
				//Сообщить("Для счета № "+СокрЛП(стр.НомерСчета.Код)+" расчет либо не сделан, либо сумма = 0.");
				Сообщить("Для счета № "+СокрЛП(стр.НомерСчета)+" расчет либо не сделан, либо сумма = 0.");
				// Молчанов Ортикон КОНЕЦ 28.12.2017
			КонецЕсли;	
		КонецЦикла;
		//Бардошина -
	КонецЕсли;	
КонецПроцедуры   

Функция СформироватьТаблицуСчетов(Объект, ТекПериодичность, НачалоПериода)
	
	ДатаКонПериода = уп_НПФ.ОпределитьДатуКонцаПериода(Объект.ПериодНачисления,ТекПериодичность);
	Запрос = Новый Запрос; 
	//Бардошина +
	//текст запроса изменен: добавлена возможность расчета по ТЧ npo_НачислениеЗадолженностиПоПриостановкам, 
	//вывод поля ЭтаЗадолженность и расширено условие на состояние ПС
	//не нужны записи с флагом "ЭтоВосстановлениеЗадолженности"
	Запрос.Текст = "ВЫБРАТЬ
	               |	уп_НачислениеПенсийСписокПенсионеров.НомерСчета КАК НомерСчета,
	               |	уп_НачислениеПенсийСписокПенсионеров.Периодичность КАК Периодичность,
	               |	уп_НачислениеПенсийСписокПенсионеров.Участник КАК Участник,
	               |	ЛОЖЬ КАК ЭтоЗадолженность
	               |ПОМЕСТИТЬ ДанныеТЧ
	               |ИЗ
	               |	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК уп_НачислениеПенсийСписокПенсионеров
	               |ГДЕ
	               |	уп_НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
	               |	И уп_НачислениеПенсийСписокПенсионеров.Периодичность = &Периодичность
	               |	И уп_НачислениеПенсийСписокПенсионеров.НачалоПериодаНачисления = &НачалоПериодаНачисления
	               |	И НЕ уп_НачислениеПенсийСписокПенсионеров.ЭтоВосстановлениеЗадолженности
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.НомерСчета,
	               |	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Периодичность,
	               |	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Участник,
	               |	ИСТИНА
	// +ХМНПФ 08.10.2024 ЛыткинАМ // Начисление пенсии после воостановления // №3453
	//			   | И ВЫБОР КОГДА уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Ссылка.ДокументОснование Ссылка Документ.уп_ПриостановкаВыплат ТОГДА
	//			   |		НЕ уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.НачалоПериодаНачисления = уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Ссылка.ПериодНачисления ИНАЧЕ ИСТИНА КОНЕЦ
	// +ХМНПФ 08.10.2024 ЛыткинАМ // Начисление пенсии после воостановления // №3453
				   |ИЗ
	               |	Документ.уп_НачислениеПенсий.НачислениеЗадолженностиПоПриостановкам КАК уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам
	               |ГДЕ
	               |	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	НомерСчета
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеТЧ.НомерСчета КАК НомерСчета,
	               |	ДанныеТЧ.Периодичность КАК Периодичность,
	               |	ДанныеТЧ.Участник КАК Участник,
	               |	ДанныеТЧ.ЭтоЗадолженность КАК ЭтоЗадолженность,
				   |	СостоянияПССрезПоследних.ДатаУстановкиСостояния КАК Период,
	               |	0 КАК НачисленоРаннее,
	               |	СостоянияПССрезПоследних.Состояние КАК Состояние,
	               |	СостоянияПССрезПоследних.Расшифровка КАК Расшифровка
	               |ИЗ
	               |	ДанныеТЧ КАК ДанныеТЧ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.уп_СостоянияПС.СрезПоследних(
	               |				&ДатаКонПериода,
	               |				НомерСчета В
	               |					(ВЫБРАТЬ
	               |						ДанныеТЧ.НомерСчета КАК НомерСчета
	               |					ИЗ
	               |						ДанныеТЧ КАК ДанныеТЧ)) КАК СостоянияПССрезПоследних
	               |		ПО ДанныеТЧ.НомерСчета = СостоянияПССрезПоследних.НомерСчета
				   |ГДЕ
   	// +ХМНПФ 08.10.2024 ЛыткинАМ // Начисление пенсии после воостановления // №3453
				   |	&Приостановка_Начисление_КонтрольСтатуса = ЛОЖЬ ИЛИ
   	// -ХМНПФ 08.10.2024 ЛыткинАМ // Начисление пенсии после воостановления // №3453
 				   |	ВЫБОР
				   |			КОГДА ДанныеТЧ.ЭтоЗадолженность
				   |				ТОГДА СостоянияПССрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.уп_СостоянияПС.НачисленияПриостановлены)
				   |						И СостоянияПССрезПоследних.Расшифровка В (&СписокРасшифровок)
				   |			ИНАЧЕ СостоянияПССрезПоследних.Состояние = &Выплатное
				   |		КОНЕЦ";
	

	//Бардошина -
	//Запрос.УстановитьПараметр("ДатаКонПериода", ДатаКонПериода-1);
	//Запрос.УстановитьПараметр("ДатаКонПериода", КонецДня(Объект.Дата)+1);
	// +ХМНПФ 26.04.2022 ХлопцевБА // Начисление пенсии после воостановления // №3453
	Запрос.УстановитьПараметр("ДатаКонПериода", КонецМесяца(НачалоПериода));
	// -ХМНПФ 26.04.2022 ХлопцевБА // Начисление пенсии после воостановления // №3453
	//Бардошина +
	//Запрос.УстановитьПараметр("СписокСчетов", Объект.СписокПенсионеров.Выгрузить(,"НомерСчета").ВыгрузитьКолонку("НомерСчета")); 
	СписокРасшифровок = Новый СписокЗначений;
	СписокРасшифровок.Добавить(Перечисления.уп_РасшифровкаСостоянийПС.НеПрошёлПеререгистрациюПриостановлен);
	СписокРасшифровок.Добавить(Перечисления.уп_РасшифровкаСостоянийПС.НеПрошёлПеререгистрациюПриостановленСКомпенсацией);
	СписокРасшифровок.Добавить(Перечисления.уп_РасшифровкаСостоянийПС.Приостановлен);
	СписокРасшифровок.Добавить(Перечисления.уп_РасшифровкаСостоянийПС.ПриостановленСКомпенсацией);
	// +ХМНПФ 26.04.2022 ХлопцевБА // Начисление пенсии после воостановления // №3453
	СписокРасшифровок.Добавить(Перечисления.уп_РасшифровкаСостоянийПС.ПриостановленБезКомпенсации);
	// -ХМНПФ 26.04.2022 ХлопцевБА // Начисление пенсии после воостановления // №3453
	
  	// +ХМНПФ 08.10.2024 ЛыткинАМ // Начисление пенсии после воостановления // №3453
	Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.уп_ПриостановкаВыплат") Тогда
		хм_ДополнительныйКонтроль = РегистрыСведений.хм_ДополнительныйКонтроль.ПолучитьПоследнее(НачалоПериода);
		Запрос.УстановитьПараметр("Приостановка_Начисление_КонтрольСтатуса", хм_ДополнительныйКонтроль.Приостановка_Начисление_КонтрольСтатуса);
	Иначе	
		Запрос.УстановитьПараметр("Приостановка_Начисление_КонтрольСтатуса", Истина);
	КонецЕсли;
	// +ХМНПФ 08.10.2024 ЛыткинАМ // Начисление пенсии после воостановления // №3453

	Запрос.УстановитьПараметр("СписокРасшифровок", СписокРасшифровок);
    //Бардошина -
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Периодичность", ТекПериодичность);
	Запрос.УстановитьПараметр("НачалоПериодаНачисления", НачалоПериода);
	Запрос.УстановитьПараметр("Выплатное", Перечисления.уп_СостоянияПС.ВыплатнойПериод);
	
	ТабСчетов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабСчетов;
	
КонецФункции

Функция СформироватьТаблицуПериодов(Объект)

	Запрос = Новый Запрос;
	//Бардошина +
	//текст запроса изменен: добавлено объединение с ТЧ npo_НачислениеЗадолженностиПоПриостановкам,
	//пришлось вывести в ВТ, т.к. нужны записи бз повторяющихся
	//не нужны записи с флагом "ЭтоВосстановлениеЗадолженности"
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уп_НачислениеПенсийСписокПенсионеров.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
	|	уп_НачислениеПенсийСписокПенсионеров.Периодичность КАК Периодичность
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК уп_НачислениеПенсийСписокПенсионеров
	|ГДЕ
	|	уп_НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
	|	И НЕ уп_НачислениеПенсийСписокПенсионеров.ЭтоВосстановлениеЗадолженности
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.НачалоПериодаНачисления,
	|	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Периодичность
	|ИЗ
	|	Документ.уп_НачислениеПенсий.НачислениеЗадолженностиПоПриостановкам КАК уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам
	|ГДЕ
	|	уп_НачислениеПенсийnpo_НачислениеЗадолженностиПоПриостановкам.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ.НачалоПериодаНачисления КАК НачалоПериодаНачисления,
	|	ВТ.Периодичность КАК Периодичность
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоПериодаНачисления
	|ИТОГИ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ НачалоПериодаНачисления)
	|ПО
	|	Периодичность";
	//Бардошина -
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	Результат = Запрос.Выполнить();

    Возврат Результат;
	
КонецФункции

// +ХМНПФ 19.10.2017 ХлопцевБА // уп_НачислениеПенсий() // №1201
Процедура уп_НачислениеПенсий(Источник, Отказ, РежимПроведения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	хм_ДокументыСОтдельнойДатойПроведения.пДокумент,
	|	хм_ДокументыСОтдельнойДатойПроведения.Значение
	|ИЗ
	|	РегистрСведений.хм_ДокументыСОтдельнойДатойПроведения КАК хм_ДокументыСОтдельнойДатойПроведения
	|ГДЕ
	|	хм_ДокументыСОтдельнойДатойПроведения.пДокумент.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Для Каждого Движение Из Источник.Движения Цикл
			Для Каждого Стр Из Движение Цикл
				Попытка 
					Стр.Период = Выборка.Значение;
				Исключение
				КонецПопытки;
			КонецЦикла;	
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры // уп_НачислениеПенсий(Источник, Отказ, РежимПроведения)
